{
  "date": "2025-07-28",
  "pair": "USDJPY",
  "status": "PENDING_MANIPULATION",
  "lock": false,
  "daily_bias": "BULLISH",
  "asia_high": 149,
  "asia_low": 147.88,
  "htf_zone_target": "N/A",
  "entry_price": null,
  "stop_loss": null,
  "take_profit": null,
  "trade_status": "NONE",
  "result": null,
  "error_log": null,
  "stage2": {
    "extracted_data": {},
    "full_narrative": "**BAGIAN 1: COMPREHENSIVE TACTICAL ANALYSIS**\n\n**🔍 HYPOTHESIS VALIDATION ASSESSMENT:**\nAnalisis mengkonfirmasi validitas hipotesis utama. Berdasarkan **Daily Bias BULLISH**, skenario yang diprediksi adalah **Judas Swing ke bawah** untuk menyapu likuiditas sisi jual (Sell-Side Liquidity) di bawah Asia Low. Data harga selama London Killzone (dimulai pukul 13:00 WIB / 06:00 UTC) secara presisi mengeksekusi skenario ini.\n\n- **Directional Coherence:** Terkonfirmasi. Pergerakan awal dalam London Killzone adalah **BEARISH**, berlawanan langsung dengan Daily Bias **BULLISH**.\n- **Timing Alignment:** Terkonfirmasi. Manipulasi terjadi tepat pada permulaan London Killzone. Candle M15 pada pukul **13:00 WIB (06:00 UTC)** adalah pemicu utama.\n- **Boundary Breach Analysis:** Terkonfirmasi. Target likuiditas, **Asia Low (147.88)**, berhasil ditembus. Titik terendah yang tercatat pada candle pukul 13:00 WIB adalah **147.839**. Ini menghasilkan kedalaman sapuan (sweep depth) sebesar **4.1 pips** (147.88 - 147.839), yang berada dalam rentang optimal 2-5 pips untuk eksekusi stop-loss yang efisien tanpa menandakan breakout sejati. Pergerakan kembali di atas level 147.88 terjadi dalam candle 15 menit yang sama, menandakan sapuan likuiditas yang cepat dan bukan pergerakan berkelanjutan.\n\n**⚡ MANIPULATION SIGNATURE CHARACTERIZATION:**\nSignature pergerakan yang terobservasi sangat selaras dengan karakteristik Judas Swing yang otentik, bukan genuine breakout.\n\n- **Velocity Profile:** Pergerakan ke bawah menuju 147.839 bersifat cepat dan tajam (swift & surgical), dirancang untuk memicu stop-loss secara efisien. Ini diikuti oleh pembalikan (reversal) yang lebih agresif dan bertenaga ke atas, menunjukkan bahwa pergerakan ke bawah tidak memiliki niat institusional yang berkelanjutan.\n- **Volume Characteristics:** Terdapat lonjakan volume yang signifikan bertepatan dengan Killzone. Tick volume pada candle manipulatif pukul 13:00 WIB adalah **916**, meningkat dari rata-rata pra-sesi. Volume kemudian meledak pada candle konfirmasi berikutnya (13:15 WIB) menjadi **1489**, mengindikasikan masuknya order beli institusional dalam jumlah besar setelah likuiditas berhasil diekstraksi.\n- **Candle Formation Patterns:** Candle M15 pada pukul 13:00 WIB ditutup sebagai **bullish rejection candle** dengan sumbu bawah yang panjang (long lower wick) dan badan bullish yang kuat. Ini adalah signature klasik dari penolakan (rejection) setelah perburuan stop-loss, di mana Smart Money menyerap semua order jual dan mulai mendorong harga ke arah sebaliknya.\n- **Sustainability Analysis:** Pergerakan bearish gagal total untuk menunjukkan keberlanjutan. Harga tidak mampu bertahan di bawah Asia Low (147.88) bahkan untuk satu penutupan candle M15, yang secara definitif mengklasifikasikannya sebagai pergerakan palsu (false move).\n\n**🎯 HTF ZONE INTERACTION DYNAMICS:**\nHTF Zone Target dinyatakan **N/A** dalam parameter misi. Oleh karena itu, lapisan konfirmasi ini tidak dapat digunakan dalam analisis saat ini. Penilaian didasarkan sepenuhnya pada dinamika likuiditas intra-hari, struktur PO3, dan karakteristik price action dalam London Killzone. Ketiadaan zona HTF yang berdekatan berarti pergerakan ini murni didorong oleh rekayasa likuiditas pada level Asia Range.\n\n**⚖️ CONFIRMATION MATRIX SYNTHESIS:**\nSintesis dari semua bukti yang tersedia mengarah pada kesimpulan yang tegas: pergerakan yang diamati adalah **confirmed authentic Judas Swing**. Fase manipulasi dari model Power of Three telah berhasil dieksekusi.\n\n- **Supporting Evidence:**\n    1.  **Directional Inversity:** Pergerakan bearish awal selaras sempurna dengan hipotesis untuk bias bullish.\n    2.  **Precise Liquidity Sweep:** Penetrasi 4.1 pips di bawah Asia Low adalah bukti textbook dari perburuan stop-loss yang ditargetkan.\n    3.  **Immediate Rejection:** Reversal instan dalam candle yang sama dengan volume yang meningkat adalah tanda yang sangat kuat dari intervensi institusional.\n    4.  **Distribution Initiation:** Pergerakan bullish yang impulsif setelah sapuan likuiditas menandakan dimulainya fase Distribusi, sesuai dengan model AMD.\n\n- **Confidence Level:** **HIGH**. Meskipun konfirmasi dari zona HTF tidak tersedia, kejelasan dan presisi dari signature manipulasi pada level harga, waktu, dan volume memberikan tingkat kepercayaan yang sangat tinggi terhadap kesimpulan ini.\n\n**🚨 RISK ASSESSMENT & TRADE IMPLICATIONS:**\nDengan terkonfirmasinya Judas Swing, tesis trading utama tervalidasi. Implikasi taktisnya adalah bahwa harga sekarang diposisikan untuk fase Distribusi bullish.\n\n- **Key Levels for Monitoring:**\n    - **Low of the Day (LOD): 147.839.** Level ini sekarang berfungsi sebagai \"protected low\". Setiap pergerakan harga yang menembus dan ditutup di bawah level ini akan menginvalidasi seluruh tesis manipulasi bullish.\n    - **London Open Price:** Harga pembukaan Killzone (sekitar 147.854) sekarang menjadi zona support kunci. Penurunan kembali ke level ini dapat memberikan peluang entri beli dengan risiko rendah.\n- **Invalidation Scenario:** Skenario manipulasi ini akan dianggap tidak valid jika harga berbalik arah secara agresif dan ditutup secara meyakinkan di bawah **147.839**. Ini akan menunjukkan bahwa pergerakan awal bukanlah manipulasi, melainkan tanda kelemahan yang lebih besar yang tidak terdeteksi sebelumnya.\n- **Tactical Implication:** Path of least resistance sekarang adalah ke atas. Fokus beralih ke identifikasi titik masuk optimal (misalnya, Fair Value Gaps pada timeframe yang lebih rendah) dalam pergerakan bullish yang sedang berlangsung, menargetkan likuiditas sisi beli (Buy-Side Liquidity) di atas.\n\n**BAGIAN 2: STRUCTURED DATA EXTRACTION**\n\nMANIPULATION_DETECTED: TRUE\nMANIPULATION_SIDE: BELOW_ASIA_LOW\nHTF_REACTION: FALSE\nCONFIDENCE_LEVEL: HIGH\nKEY_INVALIDATION_LEVEL: 147.839",
    "timestamp": "2025-07-28T09:34:21.799Z"
  }
}